<ossec_config>

    <wodle name="azure-logs">

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id>8b7...c14</application_id>
            <application_key>w22...91x</application_key>
            <auth_path>blabla</auth_path>
            <tenantdomain>blabla</tenantdomain>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-activity</tag>
                <query>AzureActivity | where SubscriptionId == 2d7...61d </query>
                <workspace>d6b...efa</workspace>
                <timeout>blablabla</timeout>
                <time_offset>blablabla</time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id>blablabla</application_id>
            <application_key>blablabla</application_key>
            <auth_path>/Azure/graph_auth.txt</auth_path>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-active_directory</tag>
                <query>activities/audit?api-version=beta</query>
                <timeout>7200</timeout>
                <time_offset>1d</time_offset>
            </request>
        </graph>

        <storage>
            <account_name>blablabla</account_name>
            <account_key>blablabla</account_key>
            <auth_path>/home/manager/Azure/storage_auth.txt</auth_path>
            <tag>azure-activity</tag>
            <container name="insights-operational-logs">
                <blobs>.json</blobs>
                <content_type>json_inline</content_type>
                <time_offset>24h</time_offset>
            </container>
        </storage>

    </wodle>

    <wodle name="azure-logs">

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id>8b7...c14</application_id>
            <application_key>w22...91x</application_key>
            <auth_path>blabla</auth_path>
            <tenantdomain>blabla</tenantdomain>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-activity</tag>
                <query>AzureActivity | where SubscriptionId == 2d7...61d </query>
                <workspace>d6b...efa</workspace>
                <timeout>blablabla</timeout>
                <time_offset>blablabla</time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id>blablabla</application_id>
            <application_key>blablabla</application_key>
            <auth_path>/Azure/graph_auth.txt</auth_path>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-active_directory</tag>
                <query>activities/audit?api-version=beta</query>
                <timeout>7200</timeout>
                <time_offset>1d</time_offset>
            </request>
        </graph>

        <storage>
            <account_name>blablabla</account_name>
            <account_key>blablabla</account_key>
            <auth_path>/home/manager/Azure/storage_auth.txt</auth_path>
            <tag>azure-activity</tag>
            <container name="insights-operational-logs">
                <blobs>.json</blobs>
                <content_type>json_inline</content_type>
                <time_offset>24h</time_offset>
            </container>
        </storage>
        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id>8b7...c14</application_id>
            <application_key>w22...91x</application_key>
            <auth_path>blabla</auth_path>
            <tenantdomain>blabla</tenantdomain>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-activity</tag>
                <query>AzureActivity | where SubscriptionId == 2d7...61d </query>
                <workspace>d6b...efa</workspace>
                <timeout>blablabla</timeout>
                <time_offset>blablabla</time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id>blablabla</application_id>
            <application_key>blablabla</application_key>
            <auth_path>/Azure/graph_auth.txt</auth_path>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-active_directory</tag>
                <query>activities/audit?api-version=beta</query>
                <timeout>7200</timeout>
                <time_offset>1d</time_offset>
            </request>
        </graph>

        <storage>
            <account_name>blablabla</account_name>
            <account_key>blablabla</account_key>
            <auth_path>/home/manager/Azure/storage_auth.txt</auth_path>
            <tag>azure-activity</tag>
            <container name="insights-operational-logs">
                <blobs>.json</blobs>
                <content_type>json_inline</content_type>
                <time_offset>24h</time_offset>
            </container>
        </storage>

    </wodle>

</ossec_config>

<ossec_config>

    <wodle name="azure-logs">

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id></application_id>
            <application_key></application_key>
            <auth_path></auth_path>
            <tenantdomain></tenantdomain>
            <tenantdomain></tenantdomain>
            <request>
                <tag></tag>
                <query></query>
                <workspace></workspace>
                <timeout></timeout>
                <time_offset></time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id></application_id>
            <application_key></application_key>
            <auth_path></auth_path>
            <tenantdomain></tenantdomain>
            <request>
                <tag></tag>
                <query></query>
                <timeout></timeout>
                <time_offset></time_offset>
            </request>
        </graph>

        <storage>
            <account_name></account_name>
            <account_key></account_key>
            <auth_path></auth_path>
            <tag></tag>
            <container name="insights-operational-logs">
                <blobs></blobs>
                <content_type></content_type>
                <time_offset></time_offset>
            </container>
        </storage>

    </wodle>

    <wodle name="azure-logs">

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id></application_id>
            <application_key></application_key>
            <auth_path></auth_path>
            <tenantdomain></tenantdomain>
            <tenantdomain></tenantdomain>
            <request>
                <tag></tag>
                <query></query>
                <workspace></workspace>
                <timeout></timeout>
                <time_offset></time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id></application_id>
            <application_key></application_key>
            <auth_path></auth_path>
            <tenantdomain></tenantdomain>
            <request>
                <tag></tag>
                <query></query>
                <timeout></timeout>
                <time_offset></time_offset>
            </request>
        </graph>

        <storage>
            <account_name></account_name>
            <account_key></account_key>
            <auth_path></auth_path>
            <tag></tag>
            <container name="insights-operational-logs">
                <blobs></blobs>
                <content_type></content_type>
                <time_offset></time_offset>
            </container>
        </storage>

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id></application_id>
            <application_key></application_key>
            <auth_path></auth_path>
            <tenantdomain></tenantdomain>
            <tenantdomain></tenantdomain>
            <request>
                <tag></tag>
                <query></query>
                <workspace></workspace>
                <timeout></timeout>
                <time_offset></time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id></application_id>
            <application_key></application_key>
            <auth_path></auth_path>
            <tenantdomain></tenantdomain>
            <request>
                <tag></tag>
                <query></query>
                <timeout></timeout>
                <time_offset></time_offset>
            </request>
        </graph>

        <storage>
            <account_name></account_name>
            <account_key></account_key>
            <auth_path></auth_path>
            <tag></tag>
            <container name="insights-operational-logs">
                <blobs></blobs>
                <content_type></content_type>
                <time_offset></time_offset>
            </container>
        </storage>

    </wodle>

</ossec_config>