<ossec_config>

    <wodle name="aws-s3">
        <disabled>no</disabled>
        <access_key>blablabla</access_key>
        <secret_key>blablabla</secret_key>
        <remove_from_bucket>no</remove_from_bucket>
        <interval>10m</interval>
        <run_on_start>no</run_on_start>
        <skip_on_error>no</skip_on_error>
        <bucket type="cloudtrail">
            <name>s3-dev-bucket</name>
            <access_key>insert_access_key</access_key>
            <secret_key>insert_secret_key</secret_key>
            <only_logs_after>2018-JUN-01</only_logs_after>
            <regions>us-east-1,us-west-1,eu-central-1</regions>
            <path>/dev2/</path>
            <aws_account_id>112233445566</aws_account_id>
            <aws_account_alias>dev2-account</aws_account_alias>
            <aws_profile>blablabla</aws_profile>
            <iam_role_arn>blablala</iam_role_arn>
        </bucket>
    </wodle>

    <wodle name="aws-s3">
        <disabled>no</disabled>
        <access_key>blablabla</access_key>
        <secret_key>blablabla</secret_key>
        <remove_from_bucket>no</remove_from_bucket>
        <interval>10m</interval>
        <run_on_start>no</run_on_start>
        <skip_on_error>no</skip_on_error>
        <bucket type="cloudtrail">
            <name>s3-dev-bucket</name>
            <access_key>insert_access_key</access_key>
            <secret_key>insert_secret_key</secret_key>
            <only_logs_after>2018-JUN-01</only_logs_after>
            <regions>us-east-1,us-west-1,eu-central-1</regions>
            <path>/dev2/</path>
            <aws_account_id>112233445566</aws_account_id>
            <aws_account_alias>dev2-account</aws_account_alias>
            <aws_profile>blablabla</aws_profile>
            <iam_role_arn>blablala</iam_role_arn>
        </bucket>
        <disabled>no</disabled>
        <access_key>blablabla</access_key>
        <secret_key>blablabla</secret_key>
        <remove_from_bucket>no</remove_from_bucket>
        <interval>10m</interval>
        <run_on_start>no</run_on_start>
        <skip_on_error>no</skip_on_error>
        <bucket type="cloudtrail">
            <name>s3-dev-bucket</name>
            <access_key>insert_access_key</access_key>
            <secret_key>insert_secret_key</secret_key>
            <only_logs_after>2018-JUN-01</only_logs_after>
            <regions>us-east-1,us-west-1,eu-central-1</regions>
            <path>/dev2/</path>
            <aws_account_id>112233445566</aws_account_id>
            <aws_account_alias>dev2-account</aws_account_alias>
            <aws_profile>blablabla</aws_profile>
            <iam_role_arn>blablala</iam_role_arn>
        </bucket>
    </wodle>

    <wodle name="azure-logs">

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id>8b7...c14</application_id>
            <application_key>w22...91x</application_key>
            <auth_path>blabla</auth_path>
            <tenantdomain>blabla</tenantdomain>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-activity</tag>
                <query>AzureActivity | where SubscriptionId == 2d7...61d </query>
                <workspace>d6b...efa</workspace>
                <timeout>blablabla</timeout>
                <time_offset>blablabla</time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id>blablabla</application_id>
            <application_key>blablabla</application_key>
            <auth_path>/Azure/graph_auth.txt</auth_path>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-active_directory</tag>
                <query>activities/audit?api-version=beta</query>
                <timeout>7200</timeout>
                <time_offset>1d</time_offset>
            </request>
        </graph>

        <storage>
            <account_name>blablabla</account_name>
            <account_key>blablabla</account_key>
            <auth_path>/home/manager/Azure/storage_auth.txt</auth_path>
            <tag>azure-activity</tag>
            <container name="insights-operational-logs">
                <blobs>.json</blobs>
                <content_type>json_inline</content_type>
                <time_offset>24h</time_offset>
            </container>
        </storage>

    </wodle>

    <wodle name="azure-logs">

        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id>8b7...c14</application_id>
            <application_key>w22...91x</application_key>
            <auth_path>blabla</auth_path>
            <tenantdomain>blabla</tenantdomain>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-activity</tag>
                <query>AzureActivity | where SubscriptionId == 2d7...61d </query>
                <workspace>d6b...efa</workspace>
                <timeout>blablabla</timeout>
                <time_offset>blablabla</time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id>blablabla</application_id>
            <application_key>blablabla</application_key>
            <auth_path>/Azure/graph_auth.txt</auth_path>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-active_directory</tag>
                <query>activities/audit?api-version=beta</query>
                <timeout>7200</timeout>
                <time_offset>1d</time_offset>
            </request>
        </graph>

        <storage>
            <account_name>blablabla</account_name>
            <account_key>blablabla</account_key>
            <auth_path>/home/manager/Azure/storage_auth.txt</auth_path>
            <tag>azure-activity</tag>
            <container name="insights-operational-logs">
                <blobs>.json</blobs>
                <content_type>json_inline</content_type>
                <time_offset>24h</time_offset>
            </container>
        </storage>
        <disabled>no</disabled>
        <day>15</day>
        <time>02:00</time>
        <interval>1M</interval>
        <run_on_start>yes</run_on_start>

        <log_analytics>
            <application_id>8b7...c14</application_id>
            <application_key>w22...91x</application_key>
            <auth_path>blabla</auth_path>
            <tenantdomain>blabla</tenantdomain>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-activity</tag>
                <query>AzureActivity | where SubscriptionId == 2d7...61d </query>
                <workspace>d6b...efa</workspace>
                <timeout>blablabla</timeout>
                <time_offset>blablabla</time_offset>
            </request>
        </log_analytics>

        <graph>
            <application_id>blablabla</application_id>
            <application_key>blablabla</application_key>
            <auth_path>/Azure/graph_auth.txt</auth_path>
            <tenantdomain>wazuh.onmicrosoft.com</tenantdomain>
            <request>
                <tag>azure-active_directory</tag>
                <query>activities/audit?api-version=beta</query>
                <timeout>7200</timeout>
                <time_offset>1d</time_offset>
            </request>
        </graph>

        <storage>
            <account_name>blablabla</account_name>
            <account_key>blablabla</account_key>
            <auth_path>/home/manager/Azure/storage_auth.txt</auth_path>
            <tag>azure-activity</tag>
            <container name="insights-operational-logs">
                <blobs>.json</blobs>
                <content_type>json_inline</content_type>
                <time_offset>24h</time_offset>
            </container>
        </storage>

    </wodle>

    <wodle name="cis-cat">
        <disabled>no</disabled>
        <timeout>1800</timeout>
        <wday>monday</wday>
        <time>04:00</time>
        <interval>2w</interval>
        <scan-on-start>yes</scan-on-start>
        <java_path>/usr/bin</java_path>
        <ciscat_path>wodles/ciscat</ciscat_path>
        <content type="xccdf" path="benchmarks/CIS_Ubuntu_Linux_16.04_LTS_Benchmark_v1.0.0-xccdf.xml">
            <profile>xccdf_org.cisecurity.benchmarks_profile_Level_2_-_Server</profile>
        </content>
    </wodle>

    <wodle name="cis-cat">
        <disabled>no</disabled>
        <timeout>1800</timeout>
        <day>15</day>
        <time>04:00</time>
        <interval>2w</interval>
        <scan-on-start>yes</scan-on-start>
        <java_path>/usr/bin</java_path>
        <ciscat_path>wodles/ciscat</ciscat_path>
        <content type="xccdf" path="benchmarks/CIS_Ubuntu_Linux_16.04_LTS_Benchmark_v1.0.0-xccdf.xml">
            <profile>xccdf_org.cisecurity.benchmarks_profile_Level_2_-_Server</profile>
        </content>
        <disabled>no</disabled>
        <timeout>1800</timeout>
        <day>20</day>
        <time>04:00</time>
        <interval>2w</interval>
        <scan-on-start>yes</scan-on-start>
        <java_path>/usr/bin</java_path>
        <ciscat_path>wodles/ciscat</ciscat_path>
        <content type="xccdf" path="benchmarks/CIS_Ubuntu_Linux_16.04_LTS_Benchmark_v1.0.0-xccdf.xml">
            <profile>xccdf_org.cisecurity.benchmarks_profile_Level_2_-_Server</profile>
        </content>
    </wodle>

    <wodle name="command">
        <disabled>no</disabled>
        <tag>test</tag>
        <command>/bin/bash /root/script.sh</command>
        <interval>1d</interval>
        <ignore_output>no</ignore_output>
        <run_on_start>yes</run_on_start>
        <timeout>0</timeout>
        <verify_md5>5aada3704685dad6fd27beb58e6687de</verify_md5>
        <verify_sha1>da39a3ee5e6b4b0d3255bfef95601890afd80709</verify_sha1>
        <verify_sha256>292a188e498caea5c5fbfb0beca413c980e7a5edf40d47cf70e1dbc33e4f395e</verify_sha256>
        <skip_verification>no</skip_verification>
    </wodle>

    <wodle name="command">
        <disabled>no</disabled>
        <tag>test</tag>
        <command>/bin/bash /root/script.sh</command>
        <interval>1d</interval>
        <ignore_output>no</ignore_output>
        <run_on_start>yes</run_on_start>
        <timeout>0</timeout>
        <verify_md5>5aada3704685dad6fd27beb58e6687de</verify_md5>
        <verify_sha1>da39a3ee5e6b4b0d3255bfef95601890afd80709</verify_sha1>
        <verify_sha256>292a188e498caea5c5fbfb0beca413c980e7a5edf40d47cf70e1dbc33e4f395e</verify_sha256>
        <skip_verification>no</skip_verification>
        <disabled>no</disabled>
        <tag>test</tag>
        <command>/bin/bash /root/script.sh</command>
        <interval>1d</interval>
        <ignore_output>no</ignore_output>
        <run_on_start>yes</run_on_start>
        <timeout>0</timeout>
        <verify_md5>5aada3704685dad6fd27beb58e6687de</verify_md5>
        <verify_sha1>da39a3ee5e6b4b0d3255bfef95601890afd80709</verify_sha1>
        <verify_sha256>292a188e498caea5c5fbfb0beca413c980e7a5edf40d47cf70e1dbc33e4f395e</verify_sha256>
        <skip_verification>no</skip_verification>
    </wodle>

    <wodle name="docker-listener">
        <interval>10m</interval>
        <attempts>5</attempts>
        <run_on_start>no</run_on_start>
        <disabled>no</disabled>
    </wodle>

    <wodle name="docker-listener">
        <interval>10m</interval>
        <attempts>5</attempts>
        <run_on_start>no</run_on_start>
        <disabled>no</disabled>
        <interval>10m</interval>
        <attempts>5</attempts>
        <run_on_start>no</run_on_start>
        <disabled>no</disabled>
    </wodle>

    <wodle name="agent-key-polling">
        <enabled>yes</enabled>
        <timeout>60</timeout>
        <exec_path>/usr/bin/python /home/script.py</exec_path>
        <socket>blablabla</socket>
        <threads>1</threads>
        <queue_size>1024</queue_size>
        <force_insert>yes</force_insert>
    </wodle>

    <wodle name="agent-key-polling">
        <enabled>yes</enabled>
        <timeout>60</timeout>
        <exec_path>/usr/bin/python /home/script.py</exec_path>
        <socket>blablabla</socket>
        <threads>1</threads>
        <queue_size>1024</queue_size>
        <force_insert>yes</force_insert>
        <enabled>yes</enabled>
        <timeout>60</timeout>
        <exec_path>/usr/bin/python /home/script.py</exec_path>
        <socket>blablabla</socket>
        <threads>1</threads>
        <queue_size>1024</queue_size>
        <force_insert>yes</force_insert>
    </wodle>

    <wodle name="open-scap">
        <disabled>no</disabled>
        <timeout>1800</timeout>
        <interval>1d</interval>
        <scan-on-start>yes</scan-on-start>
        <content type="xccdf" path="ssg-centos-7-ds.xml"/>
        <content type="xccdf" path="ssg-centos-6-ds.xml"/>
    </wodle>

    <wodle name="open-scap">
        <disabled>no</disabled>
        <timeout>1800</timeout>
        <interval>1d</interval>
        <scan-on-start>yes</scan-on-start>
        <content type="xccdf" path="ssg-centos-7-ds.xml"/>
        <content type="xccdf" path="ssg-centos-6-ds.xml"/>
        <disabled>no</disabled>
        <timeout>1800</timeout>
        <interval>1d</interval>
        <scan-on-start>yes</scan-on-start>
        <content type="xccdf" path="ssg-centos-7-ds.xml"/>
        <content type="xccdf" path="ssg-centos-6-ds.xml"/>
    </wodle>

    <wodle name="osquery">
        <disabled>no</disabled>
        <run_daemon>yes</run_daemon>
        <bin_path>/usr/bin</bin_path>
        <log_path>/var/log/osquery/osqueryd.results.log</log_path>
        <config_path>/etc/osquery/osquery.conf</config_path>
        <add_labels>no</add_labels>
        <pack name="custom_pack">/path/to/custom_pack.conf</pack>
    </wodle>

    <wodle name="osquery">
        <disabled>no</disabled>
        <run_daemon>yes</run_daemon>
        <bin_path>/usr/bin</bin_path>
        <log_path>/var/log/osquery/osqueryd.results.log</log_path>
        <config_path>/etc/osquery/osquery.conf</config_path>
        <add_labels>no</add_labels>
        <pack name="custom_pack">/path/to/custom_pack.conf</pack>
        <disabled>no</disabled>
        <run_daemon>yes</run_daemon>
        <bin_path>/usr/bin</bin_path>
        <log_path>/var/log/osquery/osqueryd.results.log</log_path>
        <config_path>/etc/osquery/osquery.conf</config_path>
        <add_labels>no</add_labels>
        <pack name="custom_pack">/path/to/custom_pack.conf</pack>    
    </wodle>

    <wodle name="syscollector">
        <disabled>no</disabled>
        <interval>1h</interval>
        <scan_on_start>yes</scan_on_start>
        <hardware>yes</hardware>
        <os>yes</os>
        <network>yes</network>
        <packages>yes</packages>
        <ports all="no">yes</ports>
        <processes>yes</processes>
    </wodle>

    <wodle name="syscollector">
        <disabled>no</disabled>
        <interval>1h</interval>
        <scan_on_start>yes</scan_on_start>
        <hardware>yes</hardware>
        <os>yes</os>
        <network>yes</network>
        <packages>yes</packages>
        <ports all="no">yes</ports>
        <processes>yes</processes>
        <disabled>no</disabled>
        <interval>1h</interval>
        <scan_on_start>yes</scan_on_start>
        <hardware>yes</hardware>
        <os>yes</os>
        <network>yes</network>
        <packages>yes</packages>
        <ports all="no">yes</ports>
        <processes>yes</processes>
    </wodle>

</ossec_config>